* Functions Returning Functions

#+begin_src js :eval yes :tangle no
function loggerMaker() {
  return function(label, value) {
    console.log(`${label} --> ${value}`)
  }
}

const l = loggerMaker();

l('the sum of 5 and 3', 5 + 3)
#+end_src

#+RESULTS:
: the sum of 5 and 3 --> 8

#+begin_src js :tangle yes :eval yes
require('colors')

function loggerMaker(useColor) {
  if (useColor) {
    return function(label, value) {
      console.log(`${label.red} --> ${value.toString().green}`)
    }
  }

  return function(label, value) {
    console.log(`${label} --> ${value}`)
  }
}

const l = loggerMaker();
const lwc = loggerMaker(true)

l('the sum of 5 and 3', 5 + 3)
lwc('the sum of 5 and 3', 5 + 3)
#+end_src

#+RESULTS:
